linux-lab-beaver.html
---
layout: page
title: Using Beaver to Collect Linux Software Logs from the CAEN Labs
---

<script>
  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
  (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
  m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
  })(window,document,'script','//www.google-analytics.com/analytics.js','ga');

  ga('create', 'UA-55726337-1', 'auto');
  ga('send', 'pageview');

</script>

<p>
Beaver is a light-weight logfile shipping daemon written in Python.
Wild beavers weigh about 20kg and chew through logs and drag them to a
central location to build their dams; Beavers in Python consume about
2MB of RAM and chew through logs to ship the data to a central
location.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">The CAEN Beaver Configuration</h2>
<div class="outline-text-2" id="text-1">
<pre class="example">
[beaver]
format: raw
sincedb_path: /var/run/beaver/beaver.sqlite
logstash_version: 1
fqdn: True
tcp_host: linuxlog.engin.umich.edu
tcp_port: 9999

[/var/log/audit/audit.log]
type: linux
tags: caen
add_field_env:product,CAEN_PRODUCT,edition,CAEN_edition
</pre>

<p>
This configuration sends version 1 Logstash information that is newer
than the state kept in <code>/var/run/beaver/beaver.sqlite</code> to
<code>linuxlog.engin.umich.edu</code> and augments the data from
<code>/var/log/audit/audit.log</code> with a Type of <code>linux</code>, a Tag of <code>caen</code>,
and <code>product</code> and <code>edition</code> fields pulled from local environment
variables.
</p>
</div>
</div>
